ЯМБух.ЯндексМаршрутизация/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4f2c4b13-3dfb-4b87-bc22-07f8e2972770">
  <name>РеализацияТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ЯМ_РежимРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="75e0b3fa-b91c-4e92-ab51-b3bfd40c8670">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="76fa3c69-0377-471a-97ca-44878a98cd8c">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="53de5ae1-60fb-43b8-adfa-305ab44e275e">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="0a4155b0-e434-4aee-a802-02e965b39869">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f2e24ed6-5bbb-42d8-b334-7352419f6b14">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЯМБух.ЯндексМаршрутизация/src/Documents/РеализацияТоваровУслуг/Forms/ФормаДоставка/Module.bsl
&НаСервере
Процедура СохранитьДанныеРежимаРаботы()
	
	Если Не ЗначениеЗаполнено(ЯМ_РежимРаботы) Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
	ИмяКлючОбъекта(),
	ИмяКлючНастроек(),
	Новый Соответствие);
	
	ДанныеРежимРаботы = Новый Структура;
	Настройки.Вставить(ЯМ_РежимРаботы, ДанныеРежимРаботы);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
	ИмяКлючОбъекта(),
	ИмяКлючНастроек(),
	Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЯМ_КомандаОКПеред(Команда)
	Если ЗначениеЗаполнено(ЯМ_РежимРаботы) Тогда
		СохранитьДанныеРежимаРаботы();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЯМ_ПриЗакрытииВместо(ЗавершениеРаботы)
	Если ПеренестиВДокумент И Модифицированность Тогда
		СтруктураРезультат = Новый Структура("
			|Грузоотправитель,Грузополучатель, ПеревозкаАвтотранспортом,
			|АдресДоставки, Перевозчик, МаркаАвтомобиля, РегистрационныйЗнакАвтомобиля,
			|МаркаПрицепа, РегистрационныйЗнакПрицепа,
			|СведенияОТранспортировкеИГрузе,ЯМ_РежимРаботы,
			|Водитель, ВодительскоеУдостоверение, КраткоеНаименованиеГруза, СопроводительныеДокументы");
		
		ЗаполнитьЗначенияСвойств(СтруктураРезультат, ЭтаФорма);
		
		Если ГрузоотправительОнЖе = 1 Тогда
			СтруктураРезультат.Грузоотправитель = Неопределено;
		КонецЕсли;

		Если ГрузополучательОнЖе = 1 Тогда
			СтруктураРезультат.Грузополучатель = Неопределено;
		КонецЕсли;
		
		Если ПеревозчикОнЖе = 1 Тогда
			СтруктураРезультат.Перевозчик = Неопределено;
		КонецЕсли;
		
		ОповеститьОВыборе(СтруктураРезультат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЯМ_ПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	// Заполним реквизиты формы из параметров.
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры,
		"Организация, Контрагент, Грузоотправитель, Грузополучатель,
		|АдресДоставки, ДатаДокумента,СведенияОТранспортировкеИГрузе,
		|ПеревозкаАвтотранспортом,СпособДоставки,
		|Перевозчик, МаркаАвтомобиля, РегистрационныйЗнакАвтомобиля,
		|МаркаПрицепа, РегистрационныйЗнакПрицепа,ЯМ_РежимРаботы,
		|Водитель, ВодительскоеУдостоверение, КраткоеНаименованиеГруза, СопроводительныеДокументы
		|");
	
	ПолноеНаименованиеКонтрагента = "";
	СсылкаДляПереходаНаКарту = УправлениеКонтактнойИнформациейБП.СтрокаСсылкиПоказатьНаКарте();
	
	// Отобразим грузоотправителя и грузополучателя
	Если НЕ ЗначениеЗаполнено(Грузоотправитель) Тогда
		ГрузоотправительОнЖе = 1;
	Иначе
		ГрузоотправительОнЖе = 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Грузополучатель) Тогда
		ГрузополучательОнЖе = 1;
	Иначе
		ГрузополучательОнЖе = 0;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Перевозчик) Тогда
		ПеревозчикОнЖе = 1;
	Иначе
		ПеревозчикОнЖе = 0;
	КонецЕсли;
	
	// Если самовывоз или доставка собственными силами - можно выбрать перевозчика, так как он не задан в виде отгрузки
	Элементы.ГруппаПеревозчик.Доступность  = НЕ ЗначениеЗаполнено(СпособДоставки) 
		ИЛИ ЗначениеЗаполнено(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СпособДоставки, "ИмяПредопределенныхДанных"));
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстГрузоотправительОнЖе = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "Наименование");
	Иначе
		ТекстГрузоотправительОнЖе = НСтр("ru = 'Организация'");
	КонецЕсли;
	Элементы.ГрузоотправительОнЖе1.СписокВыбора[0].Представление = ТекстГрузоотправительОнЖе;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ТекстПеревозчикОнЖе = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "Наименование");
	Иначе
		ТекстПеревозчикОнЖе = НСтр("ru = 'Организация'");
	КонецЕсли;
	Элементы.ПеревозчикОнЖе1.СписокВыбора[0].Представление = ТекстПеревозчикОнЖе;
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		РеквизитыКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Контрагент, "Наименование, НаименованиеПолное");
	
		ТекстГрузополучательОнЖе = РеквизитыКонтрагента.Наименование;
		
		Если ЗначениеЗаполнено(РеквизитыКонтрагента.НаименованиеПолное) Тогда
			ПолноеНаименованиеКонтрагента = РеквизитыКонтрагента.НаименованиеПолное;
		Иначе
			НаименованиеКонтрагента = РеквизитыКонтрагента.Наименование;
		КонецЕсли;
	Иначе
		ТекстГрузополучательОнЖе = НСтр("ru = 'Контрагент'");
	КонецЕсли;
	Элементы.ГрузополучательОнЖе1.СписокВыбора[0].Представление = ТекстГрузополучательОнЖе;
	
	
	ИспользоватьАдресДоставки = НЕ ПолучитьФункциональнуюОпцию("ИспользоватьДоставкуТранспортнойКомпанией") 
		ИЛИ НЕ ЗначениеЗаполнено(СпособДоставки);
		
	Элементы.ГруппаАдресДоставки.Видимость = ИспользоватьАдресДоставки;
	Если ИспользоватьАдресДоставки Тогда
		// Заполним списки выбора адреса доставки и доверенности значениями по умолчанию
		РеализацияТоваровУслугФормы.ЗаполнитьСписокАдресовДоставки(ЭтаФорма, Контрагент, Грузополучатель, ДатаДокумента);
	КонецЕсли; 
	
	
	ИспользоватьДоставкуАвтотранспортом = ПолучитьФункциональнуюОпцию("ИспользоватьДоставкуАвтотранспортом");
	Элементы.ПеревозкаАвтотранспортом.Видимость = ИспользоватьДоставкуАвтотранспортом;
	Элементы.ГруппаПеревозкаАвтотранспортом.Видимость = ИспользоватьДоставкуАвтотранспортом;
	
	ЕстьПравоНаПросмотрТранспортныхСредств = ПравоДоступа("Просмотр", Метаданные.Справочники.ТранспортныеСредства);
	Если Не ЕстьПравоНаПросмотрТранспортныхСредств Тогда
		Элементы.Марка.КнопкаВыбора = Ложь;
		Элементы.Марка.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;
	
	УстановитьЗаголовокГруппыПрицеп(ЭтотОбъект);
	
	УправлениеФормой(ЭтаФорма);
	
	// ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	ОбработкаНовостейПереопределяемый.КонтекстныеНовости_ПриСозданииНаСервере(
		ЭтаФорма,
		"БП.Документ.РеализацияТоваровУслуг",
		"ФормаРеквизитыОрганизацииКонтрагентаТовары",
		НСтр("ru='Новости: Реализация (акт, накладная, УПД)'"),
		ИдентификаторыСобытийПриОткрытии
	);
	// Конец ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
КонецПроцедуры
